{
    "projects": [
        
        {
            "id": 1,
            "name": "Flat-bot",
            "picture": "img/flat_bot.png",
            "description": ["Telegram bot designed to fetch available flats for rent around your geographical position. Unfortunately, it is not working properly at the moment because yad2, the platform it relies on, is blocking automatic requests.",
                            "You can check the code on GitHub"
                           ],
            "linkSrc": "https://github.com/Chekinm/flat-bot/",
            "nameLinkSrc": "GitHub",
            "linkDemo": "https://github.com/Chekinm/flat-bot/", 
            "nameLinkDemo": "Demo",
            "demoEnable": false
        },
        {   
            "id": 2,
            "name": "Bottle-buddy project",
            "picture": "img/bottle-buddy.png",
            "description": [
                "The project is a social network connecting people who care about recycling bottles. Users create orders for recycling their bottles, visible to others. Collectors browse and select orders, which the creator can close. The collector picks up the bottles and delivers them to a recycling center, receiving compensation.",
                "The project uses Django backend with Django Rest Framework and React frontend for user authentication, order management, and communication. It aims to streamline recycling by connecting users for convenient and efficient order creation and management.",
                "This project is currently under construction. Please be patient and wait for 3-5 minutes while the onrender starts the deployed project."
              ],
            "linkSrc": "https://github.com/Chekinm/bottle-buddy",
            "nameLinkSrc": "GitHub",
            "linkDemo": "https://github.com/Chekinm/bottle-buddy",
            "nameLinkDemo": "Demo",
            "demoEnable": false
        },
        {   
            "id": 3,
            "name": "Flask/MongoDB backend server",
            "picture": "img/flask.png",
            "description": [
                "Sample Backend Project using Flask and MongoDB:",
                "A service designed to manage images stored on an AWS S3 server,",
                "with an information database powered by MongoDB running on the Atlas cloud."],
            "linkSrc": "https://github.com/Chekinm/flask-app-fermata-homework-ubuntu",
            "nameLinkSrc": "GitHub",
            "linkDemo": "https://mchekin.aislab.pro/groups",
            "nameLinkDemo": "Online",
            "demoEnable": true
        },
        {   
            "id": 4,
            "name": "My algo practice",
            "picture": "img/bf.png",
            "description": [
                "I have assembled some of the most interesting puzzles from coding practice platforms.",
                "Check out Loopover solver, which is one of the hardest (1q rating) puzzles on Codewar.",
                "You might also be interested in some of the esoteric BrainF*** puzzles."
                ],
            "linkSrc": "https://github.com/Chekinm/Code-wars/tree/main/Loopover/",
            "nameLinkSrc": "LoopOver",
            "linkDemo": "https://github.com/Chekinm/Code-wars/tree/main/Brain-fuck/",
            "nameLinkDemo": "BrainF***",
            "demoEnable": true
        },
        {
            "id": 5,
            "name": "Abraham Lempel tribute page",
            "picture": "img/LZW.png",
            "description": ["On February 4, 2023, I heard the sad news that Abraham Lempel had passed away. He was 86 years old. The news said that he was the grandfather of all modern compression algorithms. Today, everybody knows words like MP3, JPEG, or ZIP, but only a few know who invented these technologies for us. In 1977, Abraham Lempel and Jacob Ziv published their article about a lossless data compression algorithm. Later, in 1984, Terry Welch suggested a slightly modified version of this algorithm, which we now know as the LZW compression algorithm. Their fundamental ideas are at the core of all modern compression methods.",
                            "This site was developed as an admission project for the DI bootcamp. The project uses pure HTML5 and CSS for design, and Python and Pyscript for backend automation. And yes, it has the LZW algorithm implemented inside."
                           ],
            "linkSrc": "https://github.com/Chekinm/chekinm.github.io",
            "nameLinkSrc": "GitHub",
            "linkDemo": "https://chekinm.github.io/", 
            "nameLinkDemo": "Demo",
            "demoEnable": true
        }
    ]
}